Revit 2027 API
DetailCurveArray.Item Property
Gets or sets an item at a specified index within the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual DetailCurve this[
	int index
] { get; set; }
Public Overridable Property Item (
	index As Integer
) As DetailCurve
	Get
	Set
public:
virtual property DetailCurve^ Item[int index] {
	DetailCurve^ get (int index);
	void set (int index, DetailCurve^ value);
}
abstract Item : DetailCurve with get, set
override Item : DetailCurve with get, set
Parameters
index Int32
The index of the item to be set or retrieved.
Return Value
DetailCurve
Returns the object at the specified index.
See Also
Reference
DetailCurveArray Class
Autodesk.Revit.DB Namespace